# ContainsValidArcRadiiForStyleAndBarType Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Rebar..::..ContainsValidArcRadiiForStyleAndBarType Method
Rebar Class See Also
---
Checks that all arcs in the chain of curves have radii that are not less than minimum bend radius for bar type and style
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2009
# Syntax
C#
---
```text
public static bool ContainsValidArcRadiiForStyleAndBarType(
	IList<Curve> curves,
	RebarStyle style,
	RebarBarType barType
)
```

Visual Basic
---
```text
Public Shared Function ContainsValidArcRadiiForStyleAndBarType ( _
	curves As IList(Of Curve), _
	style As RebarStyle, _
	barType As RebarBarType _
) As Boolean
```

Visual C++
---
```text
public:
static bool ContainsValidArcRadiiForStyleAndBarType(
	IList<Curve^>^ curves,
	RebarStyle style,
	RebarBarType^ barType
)
```

# ### Parameters
curves
    Type: System.Collections.Generic..::..IList<(Of <(<'Curve>)>)> An array of curves intended to define the shape of the rebar curves. Bends and hooks should not be included in the array of curves.
style
    Type: Autodesk.Revit.DB.Structure..::..RebarStyle The usage of the bar, "standard" or "stirrup/tie".
barType
    Type: Autodesk.Revit.DB.Structure..::..RebarBarType A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
# ### Return Value
Returns true if all arc bend radii are not less than minimum bend radius for bar type and style
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace